GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
/****************************************************************************
 * arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <stdint.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/clock.h>
#include <nuttx/signal.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbhost.h>
#include <nuttx/usb/usbhost_devaddr.h>
#include <nuttx/usb/usbhost_trace.h>

#include <nuttx/irq.h>

#include "chip.h"             /* Includes default GPIO settings */
#include "gd32e11x_gpio.h"   /* GPIO configuration definitions */
#include <arch/board/board.h> /* May redefine GPIO settings */
#include "gd32e11x_rcu.h"

#include "arm_internal.h"
#include "gd32e11x_usbhost.h"

#if defined(CONFIG_USBHOST) && defined(CONFIG_GD32E11X_USBFS)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* GD32E11x USBFS Host Driver Support
 *
 * Pre-requisites
 *
 *  CONFIG_USBHOST      - Enable general USB host support
 *  CONFIG_GD32E11X_USBFS  - Enable the GD32E11x USBFS block
 *
 * Options:
 *
 *  CONFIG_GD32E11X_USBFS_RXFIFO_SIZE - Size of the RX FIFO in 32-bit words.
 *    Default 128 (512 bytes)
 *  CONFIG_GD32E11X_USBFS_NPTXFIFO_SIZE - Size of the non-periodic Tx FIFO
 *    in 32-bit words.  Default 96 (384 bytes)
 *  CONFIG_GD32E11X_USBFS_PTXFIFO_SIZE - Size of the periodic Tx FIFO in
 *    32-bit words.  Default 96 (384 bytes)
 *  CONFIG_GD32E11X_USBFS_DESCSIZE - Maximum size of a descriptor.  Default:
 *    128
 *  CONFIG_GD32E11X_USBFS_SOFINTR - Enable SOF interrupts.  Why would you
 *    ever want to do that?
 *  CONFIG_GD32E11X_USBHOST_REGDEBUG - Enable very low-level register access
 *    debug.  Depends on CONFIG_DEBUG.
 *  CONFIG_GD32E11X_USBHOST_PKTDUMP - Dump all incoming and outgoing USB
 *    packets. Depends on CONFIG_DEBUG.
 */

/* Pre-requisites (partial) */

/* USBFS 48MHz clock prescaler selection based on SYSCLK frequency */
#if (GD32_SYSCLK_FREQUENCY == 48000000)
#define GD32_USBFSPSC_VALUE  RCU_CFG0_USBFSPSC_DIV1
#elif (GD32_SYSCLK_FREQUENCY == 72000000)
#define GD32_USBFSPSC_VALUE  RCU_CFG0_USBFSPSC_DIV1_5
#elif (GD32_SYSCLK_FREQUENCY == 96000000)
#define GD32_USBFSPSC_VALUE  RCU_CFG0_USBFSPSC_DIV2
#elif (GD32_SYSCLK_FREQUENCY == 120000000)
#define GD32_USBFSPSC_VALUE  RCU_CFG0_USBFSPSC_DIV2_5
#else
#error "Unsupported GD32_SYSCLK_FREQUENCY for USBFS 48MHz clock"
#endif

/* Default RxFIFO size */

#ifndef CONFIG_GD32E11X_USBFS_RXFIFO_SIZE
#  define CONFIG_GD32E11X_USBFS_RXFIFO_SIZE 128
#endif

/* Default host non-periodic Tx FIFO size */

#ifndef CONFIG_GD32E11X_USBFS_NPTXFIFO_SIZE
#  define CONFIG_GD32E11X_USBFS_NPTXFIFO_SIZE 96
#endif

/* Default host periodic Tx fifo size register */

#ifndef CONFIG_GD32E11X_USBFS_PTXFIFO_SIZE
#  define CONFIG_GD32E11X_USBFS_PTXFIFO_SIZE 96
#endif

/* Maximum size of a descriptor */

#ifndef CONFIG_GD32E11X_USBFS_DESCSIZE
#  define CONFIG_GD32E11X_USBFS_DESCSIZE 128
#endif

/* Register/packet debug depends on CONFIG_DEBUG */

#ifndef CONFIG_DEBUG
#  undef CONFIG_GD32E11X_USBHOST_REGDEBUG
#  undef CONFIG_GD32E11X_USBHOST_PKTDUMP
#endif

/* HCD Setup ****************************************************************/

/* Hardware capabilities */

#define GD32_NHOST_CHANNELS      8   /* Number of host channels */
#define GD32_MAX_PACKET_SIZE     64  /* Full speed max packet size */
#define GD32_EP0_DEF_PACKET_SIZE 8   /* EP0 default packet size */
#define GD32_EP0_MAX_PACKET_SIZE 64  /* EP0 FS max packet size */
#define GD32_MAX_TX_FIFOS        8   /* Max number of TX FIFOs */
#define GD32_MAX_PKTCOUNT        256 /* Max packet count */
#define GD32_RETRY_COUNT         3   /* Number of ctrl transfer retries */

/* Delays *******************************************************************/

#define GD32_READY_DELAY         200000      /* In loop counts */
#define GD32_FLUSH_DELAY         200000      /* In loop counts */
#define GD32_SETUP_DELAY         SEC2TICK(5) /* 5 seconds in system ticks */
#define GD32_DATANAK_DELAY       SEC2TICK(5) /* 5 seconds in system ticks */

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The following enumeration represents the various states of the USB host
 * state machine (for debug purposes only)
 */

enum gd32_smstate_e
{
  SMSTATE_DETACHED = 0,  /* Not attached to a device */
  SMSTATE_ATTACHED,      /* Attached to a device */
  SMSTATE_ENUM,          /* Attached, enumerating */
  SMSTATE_CLASS_BOUND,   /* Enumeration complete, class bound */
};

/* This enumeration provides the reason for the channel halt. */

enum gd32_chreason_e
{
  CHREASON_IDLE = 0,     /* Inactive (initial state) */
  CHREASON_FREED,        /* Channel is no longer in use */
  CHREASON_XFRC,         /* Transfer complete */
  CHREASON_NAK,          /* NAK received */
  CHREASON_NYET,         /* NotYet received */
  CHREASON_STALL,        /* Endpoint stalled */
  CHREASON_TXERR,        /* Transfer error received */
  CHREASON_DTERR,        /* Data toggle error received */
  CHREASON_FRMOR,        /* Frame overrun */
  CHREASON_CANCELLED     /* Transfer cancelled */
};

/* This structure retains the state of one host channel.  NOTE: Since there
 * is only one channel operation active at a time, some of the fields in
 * in the structure could be moved in struct gd32_ubhost_s to achieve
 * some memory savings.
 */

struct gd32_chan_s
{
  sem_t             waitsem;   /* Channel wait semaphore */
  volatile uint8_t  result;    /* The result of the transfer */
  volatile uint8_t  chreason;  /* Channel halt reason. See enum gd32_chreason_e */
  uint8_t           chidx;     /* Channel index */
  uint8_t           epno;      /* Device endpoint number (0-127) */
  uint8_t           eptype;    /* See USBFS_EPTYPE_* definitions */
  uint8_t           funcaddr;  /* Device function address */
  uint8_t           speed;     /* Device speed */
  uint8_t           interval;  /* Interrupt/isochronous EP polling interval */
  uint8_t           pid;       /* Data PID */
  uint8_t           npackets;  /* Number of packets (for data toggle) */
  bool              inuse;     /* True: This channel is "in use" */
  volatile bool     indata1;   /* IN data toggle. True: DATA01 (Bulk and INTR only) */
  volatile bool     outdata1;  /* OUT data toggle.  True: DATA01 */
  bool              in;        /* True: IN endpoint */
  volatile bool     waiter;    /* True: Thread is waiting for a channel event */
  uint16_t          maxpacket; /* Max packet size */
  uint16_t          buflen;    /* Buffer length (at start of transfer) */
  volatile uint16_t xfrd;      /* Bytes transferred (at end of transfer) */
  volatile uint16_t inflight;  /* Number of Tx bytes "in-flight" */
  uint8_t          *buffer;    /* Transfer buffer pointer */
#ifdef CONFIG_USBHOST_ASYNCH
  usbhost_asynch_t  callback;  /* Transfer complete callback */
  void             *arg;       /* Argument that accompanies the callback */
#endif
};

/* A channel represents on uni-directional endpoint.  So, in the case of the
 * bi-directional, control endpoint, there must be two channels to represent
 * the endpoint.
 */

