GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
struct gd32_ctrlinfo_s
{
  uint8_t           inndx;     /* EP0 IN control channel index */
  uint8_t           outndx;    /* EP0 OUT control channel index */
};

/* This structure retains the state of the USB host controller */

struct gd32_usbhost_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbhost_s
   * to struct gd32_usbhost_s.
   */

  struct usbhost_driver_s drvr;

  /* This is the hub port description understood by class drivers */

  struct usbhost_roothubport_s rhport;

  /* Overall driver status */

  volatile uint8_t  smstate;     /* The state of the USB host state machine */
  uint8_t           chidx;       /* ID of channel waiting for space in Tx FIFO */
  volatile bool     connected;   /* Connected to device */
  volatile bool     change;      /* Connection change */
  volatile bool     pscwait;     /* True: Thread is waiting for a port event */
  mutex_t           lock;        /* Support mutually exclusive access */
  sem_t             pscsem;      /* Semaphore to wait for a port event */
  struct gd32_ctrlinfo_s ep0;    /* Root hub port EP0 description */

#ifdef CONFIG_USBHOST_HUB
  /* Used to pass external hub port events */

  volatile struct usbhost_hubport_s *hport;
#endif

  struct usbhost_devaddr_s devgen;  /* Address generation data */

  /* The state of each host channel */

  struct gd32_chan_s chan[GD32_MAX_TX_FIFOS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#ifdef CONFIG_GD32E11X_USBHOST_REGDEBUG
static void gd32_printreg(uint32_t addr, uint32_t val, bool iswrite);
static void gd32_checkreg(uint32_t addr, uint32_t val, bool iswrite);
static uint32_t gd32_getreg(uint32_t addr);
static void gd32_putreg(uint32_t addr, uint32_t value);
#else
#  define gd32_getreg(addr)     getreg32(addr)
#  define gd32_putreg(addr,val) putreg32(val,addr)
#endif

static inline void gd32_modifyreg(uint32_t addr, uint32_t clrbits,
                                     uint32_t setbits);

#ifdef CONFIG_GD32E11X_USBHOST_PKTDUMP
#  define gd32_pktdump(m,b,n) lib_dumpbuffer(m,b,n)
#else
#  define gd32_pktdump(m,b,n)
#endif

/* Byte stream access helper functions **************************************/

static inline uint16_t gd32_getle16(const uint8_t *val);

/* Channel management *******************************************************/

static int gd32_chan_alloc(struct gd32_usbhost_s *priv);
static inline void gd32_chan_free(struct gd32_usbhost_s *priv,
                                     int chidx);
static inline void gd32_chan_freeall(struct gd32_usbhost_s *priv);
static void gd32_chan_configure(struct gd32_usbhost_s *priv,
                                   int chidx);
static void gd32_chan_halt(struct gd32_usbhost_s *priv,
                              int chidx, enum gd32_chreason_e chreason);
static int gd32_chan_waitsetup(struct gd32_usbhost_s *priv,
                                  struct gd32_chan_s *chan);
#ifdef CONFIG_USBHOST_ASYNCH
static int gd32_chan_asynchsetup(struct gd32_usbhost_s *priv,
                                    struct gd32_chan_s *chan,
                                    usbhost_asynch_t callback,
                                    void *arg);
#endif
static int gd32_chan_wait(struct gd32_usbhost_s *priv,
                             struct gd32_chan_s *chan);
static void gd32_chan_wakeup(struct gd32_usbhost_s *priv,
                                struct gd32_chan_s *chan);
static int gd32_ctrlchan_alloc(struct gd32_usbhost_s *priv,
                                  uint8_t epno, uint8_t funcaddr,
                                  uint8_t speed,
                                  struct gd32_ctrlinfo_s *ctrlep);
static int gd32_ctrlep_alloc(struct gd32_usbhost_s *priv,
                                const struct usbhost_epdesc_s *epdesc,
                                usbhost_ep_t *ep);
static int gd32_xfrep_alloc(struct gd32_usbhost_s *priv,
                                const struct usbhost_epdesc_s *epdesc,
                                usbhost_ep_t *ep);

/* Control/data transfer logic **********************************************/

static void gd32_transfer_start(struct gd32_usbhost_s *priv,
                                   int chidx);
static int gd32_ctrl_sendsetup(struct gd32_usbhost_s *priv,
                                  struct gd32_ctrlinfo_s *ep0,
                                  const struct usb_ctrlreq_s *req);
static int gd32_ctrl_senddata(struct gd32_usbhost_s *priv,
                                 struct gd32_ctrlinfo_s *ep0,
                                 uint8_t *buffer, unsigned int buflen);
static int gd32_ctrl_recvdata(struct gd32_usbhost_s *priv,
                                 struct gd32_ctrlinfo_s *ep0,
                                 uint8_t *buffer, unsigned int buflen);
static int gd32_in_setup(struct gd32_usbhost_s *priv, int chidx);
static ssize_t gd32_in_transfer(struct gd32_usbhost_s *priv,
                                   int chidx, uint8_t *buffer,
                                   size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static void gd32_in_next(struct gd32_usbhost_s *priv,
                            struct gd32_chan_s *chan);
static int gd32_in_asynch(struct gd32_usbhost_s *priv, int chidx,
                             uint8_t *buffer, size_t buflen,
                             usbhost_asynch_t callback, void *arg);
#endif
static int gd32_out_setup(struct gd32_usbhost_s *priv, int chidx);
static ssize_t gd32_out_transfer(struct gd32_usbhost_s *priv,
                                    int chidx, uint8_t *buffer,
                                    size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static void gd32_out_next(struct gd32_usbhost_s *priv,
                             struct gd32_chan_s *chan);
static int gd32_out_asynch(struct gd32_usbhost_s *priv, int chidx,
                              uint8_t *buffer, size_t buflen,
                              usbhost_asynch_t callback, void *arg);
#endif

