GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
/* Interrupt handling *******************************************************/

/* Lower level interrupt handlers */

static void gd32_gint_wrpacket(struct gd32_usbhost_s *priv,
                                  uint8_t *buffer, int chidx,
                                  int buflen);
static inline void gd32_gint_hcinisr(struct gd32_usbhost_s *priv,
                                        int chidx);
static inline void gd32_gint_hcoutisr(struct gd32_usbhost_s *priv,
                                         int chidx);
static void gd32_gint_connected(struct gd32_usbhost_s *priv);
static void gd32_gint_disconnected(struct gd32_usbhost_s *priv);

/* Second level interrupt handlers */

#ifdef CONFIG_GD32E11X_USBFS_SOFINTR
static inline void gd32_gint_sofisr(struct gd32_usbhost_s *priv);
#endif
static inline void
gd32_gint_rxflvlisr(struct gd32_usbhost_s *priv);
static inline void
gd32_gint_nptxfeisr(struct gd32_usbhost_s *priv);
static inline void gd32_gint_ptxfeisr(struct gd32_usbhost_s *priv);
static inline void gd32_gint_hcisr(struct gd32_usbhost_s *priv);
static inline void gd32_gint_hprtisr(struct gd32_usbhost_s *priv);
static inline void gd32_gint_discisr(struct gd32_usbhost_s *priv);
static inline void gd32_gint_ipxfrisr(struct gd32_usbhost_s *priv);

/* First level, global interrupt handler */

static int gd32_gint_isr(int irq, void *context, void *arg);

/* Interrupt controls */

static void gd32_gint_enable(void);
static void gd32_gint_disable(void);
static inline void gd32_hostinit_enable(void);
static void gd32_txfe_enable(struct gd32_usbhost_s *priv,
                                int chidx);

/* USB host controller operations *******************************************/

static int gd32_wait(struct usbhost_connection_s *conn,
                        struct usbhost_hubport_s **hport);
static int gd32_rh_enumerate(struct gd32_usbhost_s *priv,
                                struct usbhost_connection_s *conn,
                                struct usbhost_hubport_s *hport);
static int gd32_enumerate(struct usbhost_connection_s *conn,
                             struct usbhost_hubport_s *hport);

static int gd32_ep0configure(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep0, uint8_t funcaddr,
                                uint8_t speed, uint16_t maxpacketsize);
static int gd32_epalloc(struct usbhost_driver_s *drvr,
                           const struct usbhost_epdesc_s *epdesc,
                           usbhost_ep_t *ep);
static int gd32_epfree(struct usbhost_driver_s *drvr,
                          usbhost_ep_t ep);
static int gd32_alloc(struct usbhost_driver_s *drvr,
                         uint8_t **buffer, size_t *maxlen);
static int gd32_free(struct usbhost_driver_s *drvr,
                        uint8_t *buffer);
static int gd32_ioalloc(struct usbhost_driver_s *drvr,
                           uint8_t **buffer, size_t buflen);
static int gd32_iofree(struct usbhost_driver_s *drvr,
                          uint8_t *buffer);
static int gd32_ctrlin(struct usbhost_driver_s *drvr,
                          usbhost_ep_t ep0,
                          const struct usb_ctrlreq_s *req,
                          uint8_t *buffer);
static int gd32_ctrlout(struct usbhost_driver_s *drvr,
                           usbhost_ep_t ep0,
                           const struct usb_ctrlreq_s *req,
                           const uint8_t *buffer);
static ssize_t gd32_transfer(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep, uint8_t *buffer,
                                size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static int gd32_asynch(struct usbhost_driver_s *drvr, usbhost_ep_t ep,
                          uint8_t *buffer, size_t buflen,
                          usbhost_asynch_t callback, void *arg);
#endif
static int gd32_cancel(struct usbhost_driver_s *drvr,
                          usbhost_ep_t ep);
#ifdef CONFIG_USBHOST_HUB
static int gd32_connect(struct usbhost_driver_s *drvr,
                           struct usbhost_hubport_s *hport,
                           bool connected);
#endif
static void gd32_disconnect(struct usbhost_driver_s *drvr,
                               struct usbhost_hubport_s *hport);

/* Initialization ***********************************************************/

static void gd32_portreset(struct gd32_usbhost_s *priv);
static void gd32_flush_txfifos(uint32_t txfnum);
static void gd32_flush_rxfifo(void);
static void gd32_vbusdrive(struct gd32_usbhost_s *priv,
                              bool state);
static void gd32_host_initialize(struct gd32_usbhost_s *priv);

static inline void gd32_sw_initialize(struct gd32_usbhost_s *priv);
static inline int gd32_hw_initialize(struct gd32_usbhost_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* In this driver implementation, support is provided for only a single a
 * single USB device.  All status information can be simply retained in a
 * single global instance.
 */

static struct gd32_usbhost_s g_usbhost =
{
  .lock = NXMUTEX_INITIALIZER,
  .pscsem = SEM_INITIALIZER(0),
};

/* This is the connection/enumeration interface */

static struct usbhost_connection_s g_usbconn =
{
  .wait      = gd32_wait,
  .enumerate = gd32_enumerate,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_printreg
 *
 * Description:
 *   Print the contents of an GD32E11x register operation
 *
 ****************************************************************************/

#ifdef CONFIG_GD32E11X_USBHOST_REGDEBUG
static void gd32_printreg(uint32_t addr, uint32_t val, bool iswrite)
{
  lldbg("%08x%s%08x\n", addr, iswrite ? "<-" : "->", val);
}
#endif

/****************************************************************************
 * Name: gd32_checkreg
 *
 * Description:
 *   Get the contents of a GD32E11x register
 *
 ****************************************************************************/

#ifdef CONFIG_GD32E11X_USBHOST_REGDEBUG
static void gd32_checkreg(uint32_t addr, uint32_t val, bool iswrite)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;
  static bool     prevwrite = false;

  /* Is this the same value that we read from/wrote to the same register
   * last time?  Are we polling the register?  If so, suppress the output.
   */

  if (addr == prevaddr && val == preval && prevwrite == iswrite)
    {
      /* Yes.. Just increment the count */

