GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
      count++;
    }
  else
    {
      /* No this is a new address or value or operation. Were there any
       * duplicate accesses before this one?
       */

      if (count > 0)
        {
          /* Yes.. Just one? */

          if (count == 1)
            {
              /* Yes.. Just one */

              gd32_printreg(prevaddr, preval, prevwrite);
            }
          else
            {
              /* No.. More than one. */

              lldbg("[repeats %d more times]\n", count);
            }
        }

      /* Save the new address, value, count, and operation for next time */

      prevaddr  = addr;
      preval    = val;
      count     = 0;
      prevwrite = iswrite;

      /* Show the new regisgter access */

      gd32_printreg(addr, val, iswrite);
    }
}
#endif

/****************************************************************************
 * Name: gd32_getreg
 *
 * Description:
 *   Get the contents of a GD32E11x register
 *
 ****************************************************************************/

#ifdef CONFIG_GD32E11X_USBHOST_REGDEBUG
static uint32_t gd32_getreg(uint32_t addr)
{
  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Check if we need to print this value */

  gd32_checkreg(addr, val, false);
  return val;
}
#endif

/****************************************************************************
 * Name: gd32_putreg
 *
 * Description:
 *   Set the contents of a GD32E11x register to a value
 *
 ****************************************************************************/

#ifdef CONFIG_GD32E11X_USBHOST_REGDEBUG
static void gd32_putreg(uint32_t addr, uint32_t val)
{
  /* Check if we need to print this value */

  gd32_checkreg(addr, val, true);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: gd32_modifyreg
 *
 * Description:
 *   Modify selected bits of a GD32E11x register.
 *
 ****************************************************************************/

static inline void gd32_modifyreg(uint32_t addr, uint32_t clrbits,
                                     uint32_t setbits)
{
  gd32_putreg(addr, (((gd32_getreg(addr)) & ~clrbits) | setbits));
}

/****************************************************************************
 * Name: gd32_getle16
 *
 * Description:
 *   Get a (possibly unaligned) 16-bit little endian value.
 *
 ****************************************************************************/

static inline uint16_t gd32_getle16(const uint8_t *val)
{
  return (uint16_t)val[1] << 8 | (uint16_t)val[0];
}

/****************************************************************************
 * Name: gd32_chan_alloc
 *
 * Description:
 *   Allocate a channel.
 *
 ****************************************************************************/

static int gd32_chan_alloc(struct gd32_usbhost_s *priv)
{
  int chidx;

  /* Search the table of channels */

  for (chidx = 0; chidx < GD32_NHOST_CHANNELS; chidx++)
    {
      /* Is this channel available? */

      if (!priv->chan[chidx].inuse)
        {
          /* Yes... make it "in use" and return the index */

          priv->chan[chidx].inuse = true;
          return chidx;
        }
    }

  /* All of the channels are "in-use" */

  return -EBUSY;
}

/****************************************************************************
 * Name: gd32_chan_free
 *
 * Description:
 *   Free a previoiusly allocated channel.
 *
 ****************************************************************************/

static void gd32_chan_free(struct gd32_usbhost_s *priv, int chidx)
{
  DEBUGASSERT((unsigned)chidx < GD32_NHOST_CHANNELS);

  /* Halt the channel */

  gd32_chan_halt(priv, chidx, CHREASON_FREED);

  /* Mark the channel available */

  priv->chan[chidx].inuse = false;
}

/****************************************************************************
 * Name: gd32_chan_freeall
 *
 * Description:
 *   Free all channels.
 *
 ****************************************************************************/

static inline void gd32_chan_freeall(struct gd32_usbhost_s *priv)
{
  uint8_t chidx;

  /* Free all host channels */

  for (chidx = 2; chidx < GD32_NHOST_CHANNELS; chidx++)
    {
      gd32_chan_free(priv, chidx);
    }
}

/****************************************************************************
 * Name: gd32_chan_configure
 *
 * Description:
 *   Configure or re-configure a host channel.  Host channels are configured
 *   when endpoint is allocated and EP0 (only) is re-configured with the
 *   max packet size or device address changes.
 *
 ****************************************************************************/

static void gd32_chan_configure(struct gd32_usbhost_s *priv,
                                   int chidx)
{
  struct gd32_chan_s *chan = &priv->chan[chidx];
  uint32_t regval;

  /* Clear any old pending interrupts for this host channel. */

  gd32_putreg(GD32_USBFS_HCHINTF(chidx), 0xffffffff);

  /* Enable channel interrupts required for transfers on this channel. */

  regval = 0;

  switch (chan->eptype)
    {
    case USBFS_EPTYPE_CTRL:
    case USBFS_EPTYPE_BULK:
      {
#ifdef HAVE_USBHOST_TRACE_VERBOSE
        uint16_t intrace;
        uint16_t outtrace;

        /* Determine the definitive trace ID to use below */

        if (chan->eptype == USBFS_EPTYPE_CTRL)
          {
            intrace  = USBFS_VTRACE2_CHANCONF_CTRL_IN;
            outtrace = USBFS_VTRACE2_CHANCONF_CTRL_OUT;
          }
        else
          {
            intrace  = USBFS_VTRACE2_CHANCONF_BULK_IN;
            outtrace = USBFS_VTRACE2_CHANCONF_BULK_OUT;
          }
#endif

        /* Interrupts required for CTRL and BULK endpoints */

        regval |= (USBFS_HCHINTF_TF | USBFS_HCHINTF_STALL |
             USBFS_HCHINTF_NAK | USBFS_HCHINTF_USBER |
             USBFS_HCHINTF_DTER);

        /* Additional setting for IN/OUT endpoints */

        if (chan->in)
          {
            usbhost_vtrace2(intrace, chidx, chan->epno);
            regval |= USBFS_HCHINTF_BBER;
          }
        else
          {
            usbhost_vtrace2(outtrace, chidx, chan->epno);
          }
      }
      break;

