GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
    case USBFS_EPTYPE_INTR:
      {
        /* Interrupts required for INTR endpoints */

        regval |= (USBFS_HCHINTF_TF  | USBFS_HCHINTF_STALL |
                   USBFS_HCHINTF_NAK   | USBFS_HCHINTF_USBER |
                   USBFS_HCHINTF_REQOVR | USBFS_HCHINTF_DTER);

        /* Additional setting for IN endpoints */

        if (chan->in)
          {
            usbhost_vtrace2(USBFS_VTRACE2_CHANCONF_INTR_IN, chidx,
                            chan->epno);
            regval |= USBFS_HCHINTF_BBER;
          }
#ifdef HAVE_USBHOST_TRACE_VERBOSE
        else
          {
            usbhost_vtrace2(USBFS_VTRACE2_CHANCONF_INTR_OUT, chidx,
                            chan->epno);
          }
#endif
      }
      break;

    case USBFS_EPTYPE_ISOC:
      {
        /* Interrupts required for ISOC endpoints */

        regval |= (USBFS_HCHINTF_TF | USBFS_HCHINTF_ACK |
             USBFS_HCHINTF_REQOVR);

        /* Additional setting for IN endpoints */

        if (chan->in)
          {
            usbhost_vtrace2(USBFS_VTRACE2_CHANCONF_ISOC_IN, chidx,
                            chan->epno);
            regval |= (USBFS_HCHINTF_USBER | USBFS_HCHINTF_BBER);
          }
#ifdef HAVE_USBHOST_TRACE_VERBOSE
        else
          {
            usbhost_vtrace2(USBFS_VTRACE2_CHANCONF_ISOC_OUT, chidx,
                            chan->epno);
          }
#endif
      }
      break;
    }

  gd32_putreg(GD32_USBFS_HCHINTEN(chidx), regval);

  /* Enable the top level host channel interrupt. */

  gd32_modifyreg(GD32_USBFS_HACHINTEN, 0, USBFS_HACHINT(chidx));

  /* Make sure host channel interrupts are enabled. */

  gd32_modifyreg(GD32_USBFS_GINTEN, 0, USBFS_GINTF_HCIF);

  /* Program the HCCHAR register */

  regval = ((uint32_t)chan->maxpacket << USBFS_HCHCTL_MPL_SHIFT) |
           ((uint32_t)chan->epno      << USBFS_HCHCTL_EPNUM_SHIFT) |
           ((uint32_t)chan->eptype    << USBFS_HCHCTL_EPTYPE_SHIFT) |
           ((uint32_t)chan->funcaddr  << USBFS_HCHCTL_DAR_SHIFT);

  /* Special case settings for low speed devices */

  if (chan->speed == USB_SPEED_LOW)
    {
      regval |= USBFS_HCHCTL_LSD;
    }

  /* Special case settings for IN endpoints */

  if (chan->in)
    {
      regval |= USBFS_HCHCTL_EPDIR_IN;
    }

  /* Special case settings for INTR endpoints */

  if (chan->eptype == USBFS_EPTYPE_INTR)
    {
      regval |= USBFS_HCHCTL_ODDFRM;
    }

  /* Write the channel configuration */

  gd32_putreg(GD32_USBFS_HCHCTL(chidx), regval);
}

/****************************************************************************
 * Name: gd32_chan_halt
 *
 * Description:
 *   Halt the channel associated with 'chidx' by setting the CHannel DISable
 *   (CHDIS) bit in in the HCCHAR register.
 *
 ****************************************************************************/

static void gd32_chan_halt(struct gd32_usbhost_s *priv, int chidx,
                              enum gd32_chreason_e chreason)
{
  uint32_t hcchar;
  uint32_t intmsk;
  uint32_t eptype;
  unsigned int avail;

  /* Save the reason for the halt.  We need this in the channel halt
   * interrupt handling logic to know what to do next.
   */

  usbhost_vtrace2(USBFS_VTRACE2_CHANHALT, chidx, chreason);

  priv->chan[chidx].chreason = (uint8_t)chreason;

  /* "The application can disable any channel by programming the
   *  USBFS_HCHxCTL register with the CHDIS and CHENA bits set to 1. This
   *  enables the USBFS host to flush the posted requests (if any) and
   *  generates a channel halted interrupt. The application must wait for
   *  the CHH interrupt in USBFS_HCHxINTF before reallocating the channel for
   *  other transactions.  The USBFS host does not interrupt the
   *  transaction that has already been started on the USB."
   */

  hcchar  = gd32_getreg(GD32_USBFS_HCHCTL(chidx));
  hcchar |= (USBFS_HCHCTL_CDIS | USBFS_HCHCTL_CEN);

  /* Get the endpoint type from the HCCHAR register */

  eptype = hcchar & USBFS_HCHCTL_EPTYPE_MASK;

  /* Check for space in the Tx FIFO to issue the halt.
   *
   * "Before disabling a channel, the application must ensure that there is
   *  at least one free space available in the non-periodic request queue
   *  (when disabling a non-periodic channel) or the periodic request queue
   *  (when disabling a periodic channel). The application can simply flush
   *  the posted requests when the Request queue is full (before disabling
   *  the channel), by programming the USBFS_HCHxCTL register with the
   *  CHDIS bit set to 1, and the CHENA bit cleared to 0.
   */

  if (eptype == USBFS_HCHCTL_EPTYPE_CTRL ||
      eptype == USBFS_HCHCTL_EPTYPE_BULK)
    {
      /* Get the number of words available in the non-periodic Tx FIFO. */

      avail = gd32_getreg(GD32_USBFS_HNPTFQSTAT) &
              USBFS_HNPTFQSTAT_NPTXFS_MASK;
    }
  else
    {
      /* Get the number of words available in the non-periodic Tx FIFO. */

      avail = gd32_getreg(GD32_USBFS_HPTFQSTAT) &
              USBFS_HPTFQSTAT_PTXFS_MASK;
    }

  /* Check if there is any space available in the Tx FIFO. */

  if (avail == 0)
    {
      /* The Tx FIFO is full... disable the channel to flush the requests */

      hcchar &= ~USBFS_HCHCTL_CEN;
    }

  /* Unmask the CHannel Halted (CHH) interrupt */

  intmsk  = gd32_getreg(GD32_USBFS_HCHINTEN(chidx));
  intmsk |= USBFS_HCHINTF_CH;
  gd32_putreg(GD32_USBFS_HCHINTEN(chidx), intmsk);

  /* Halt the channel by setting CHDIS (and maybe CHENA) in the HCCHAR */

  gd32_putreg(GD32_USBFS_HCHCTL(chidx), hcchar);
}

/****************************************************************************
 * Name: gd32_chan_waitsetup
 *
 * Description:
 *   Set the request for the transfer complete event well BEFORE enabling
 *   the transfer (as soon as we are absolutely committed to the to avoid
 *   transfer).  We do this to minimize race conditions.  This logic would
 *   have to be expanded if we want to have more than one packet in flight
 *   at a time!
 *
 * Assumptions:
 *   Called from a normal thread context BEFORE the transfer has been
 *   started.
 *
 ****************************************************************************/

static int gd32_chan_waitsetup(struct gd32_usbhost_s *priv,
                                  struct gd32_chan_s *chan)
{
  irqstate_t flags = enter_critical_section();
  int        ret   = -ENODEV;

