GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
        case USBFS_EPTYPE_INTR:
        case USBFS_EPTYPE_ISOC:
          {
            /* Read the Non-periodic Tx FIFO status register */

            regval = gd32_getreg(GD32_USBFS_HPTFQSTAT);
            avail  = ((regval & USBFS_HPTFQSTAT_PTXFS_MASK) >>
                       USBFS_HPTFQSTAT_PTXFS_SHIFT) << 2;
          }
          break;

        default:
          DEBUGPANIC();
          return;
        }

      /* Is there space in the TxFIFO to hold the minimum size packet? */

      if (minsize <= avail)
        {
          /* Yes.. Get the size of the biggest thing that we can put in
           * the Tx FIFO now
           */

          wrsize = chan->buflen;
          if (wrsize > avail)
            {
              /* Clip the write size to the number of full, max sized packets
               * that will fit in the Tx FIFO.
               */

              unsigned int wrpackets = avail / chan->maxpacket;
              wrsize = wrpackets * chan->maxpacket;
            }

          /* Write packet into the Tx FIFO. */

          gd32_gint_wrpacket(priv, chan->buffer, chidx, wrsize);
        }

      /* Did we put the entire buffer into the Tx FIFO? */

      if (chan->buflen > avail)
        {
          /* No, there was insufficient space to hold the entire transfer ...
           * Enable the Tx FIFO interrupt to handle the transfer when the Tx
           * FIFO becomes empty.
           */

           gd32_txfe_enable(priv, chidx);
        }
    }
}

/****************************************************************************
 * Name: gd32_ctrl_sendsetup
 *
 * Description:
 *   Send an IN/OUT SETUP packet.
 *
 ****************************************************************************/

static int gd32_ctrl_sendsetup(struct gd32_usbhost_s *priv,
                                  struct gd32_ctrlinfo_s *ep0,
                                  const struct usb_ctrlreq_s *req)
{
  struct gd32_chan_s *chan;
  clock_t start;
  clock_t elapsed;
  int ret;

  /* Loop while the device reports NAK (and a timeout is not exceeded */

  chan  = &priv->chan[ep0->outndx];
  start = clock_systime_ticks();

  do
    {
      /* Send the  SETUP packet */

      chan->pid    = USBFS_PID_SETUP;
      chan->buffer = (uint8_t *)req;
      chan->buflen = USB_SIZEOF_CTRLREQ;
      chan->xfrd   = 0;

      /* Set up for the wait BEFORE starting the transfer */

      ret = gd32_chan_waitsetup(priv, chan);
      if (ret < 0)
        {
          usbhost_trace1(USBFS_TRACE1_DEVDISCONN, 0);
          return ret;
        }

      /* Start the transfer */

      gd32_transfer_start(priv, ep0->outndx);

      /* Wait for the transfer to complete */

      ret = gd32_chan_wait(priv, chan);

      /* Return on success and for all failures other than EAGAIN.  EAGAIN
       * means that the device NAKed the SETUP command and that we should
       * try a few more times.
       */

      if (ret != -EAGAIN)
        {
          /* Output some debug information if the transfer failed */

          if (ret < 0)
            {
              usbhost_trace1(USBFS_TRACE1_TRNSFRFAILED, ret);
            }

          /* Return the result in any event */

          return ret;
        }

      /* Get the elapsed time (in frames) */

      elapsed = clock_systime_ticks() - start;
    }
  while (elapsed < GD32_SETUP_DELAY);

  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: gd32_ctrl_senddata
 *
 * Description:
 *   Send data in the data phase of an OUT control transfer.  Or send status
 *   in the status phase of an IN control transfer
 *
 ****************************************************************************/

static int gd32_ctrl_senddata(struct gd32_usbhost_s *priv,
                                 struct gd32_ctrlinfo_s *ep0,
                                 uint8_t *buffer, unsigned int buflen)
{
  struct gd32_chan_s *chan = &priv->chan[ep0->outndx];
  int ret;

  /* Save buffer information */

  chan->buffer = buffer;
  chan->buflen = buflen;
  chan->xfrd   = 0;

  /* Set the DATA PID */

  if (buflen == 0)
    {
      /* For status OUT stage with buflen == 0, set PID DATA1 */

      chan->outdata1 = true;
    }

  /* Set the Data PID as per the outdata1 boolean */

  chan->pid = chan->outdata1 ? USBFS_PID_DATA1 : USBFS_PID_DATA0;

  /* Set up for the wait BEFORE starting the transfer */

  ret = gd32_chan_waitsetup(priv, chan);
  if (ret < 0)
    {
      usbhost_trace1(USBFS_TRACE1_DEVDISCONN, 0);
      return ret;
    }

  /* Start the transfer */

  gd32_transfer_start(priv, ep0->outndx);

  /* Wait for the transfer to complete and return the result */

  return gd32_chan_wait(priv, chan);
}

/****************************************************************************
 * Name: gd32_ctrl_recvdata
 *
 * Description:
 *   Receive data in the data phase of an IN control transfer.  Or receive
 *   status in the status phase of an OUT control transfer
 *
 ****************************************************************************/

static int gd32_ctrl_recvdata(struct gd32_usbhost_s *priv,
                                 struct gd32_ctrlinfo_s *ep0,
                                 uint8_t *buffer, unsigned int buflen)
{
  struct gd32_chan_s *chan = &priv->chan[ep0->inndx];
  int ret;

  /* Save buffer information */

  chan->pid    = USBFS_PID_DATA1;
  chan->buffer = buffer;
  chan->buflen = buflen;
  chan->xfrd   = 0;

  /* Set up for the wait BEFORE starting the transfer */

  ret = gd32_chan_waitsetup(priv, chan);
  if (ret < 0)
    {
      usbhost_trace1(USBFS_TRACE1_DEVDISCONN, 0);
      return ret;
    }

  /* Start the transfer */

  gd32_transfer_start(priv, ep0->inndx);

  /* Wait for the transfer to complete and return the result */

  return gd32_chan_wait(priv, chan);
}

/****************************************************************************
 * Name: gd32_in_setup
 *
 * Description:
 *   Initiate an IN transfer on an bulk, interrupt, or isochronous pipe.
 *
 ****************************************************************************/

static int gd32_in_setup(struct gd32_usbhost_s *priv, int chidx)
{
  struct gd32_chan_s *chan;

  /* Set up for the transfer based on the direction and the endpoint type */

  chan = &priv->chan[chidx];
  switch (chan->eptype)
    {
    default:
    case USBFS_EPTYPE_CTRL: /* Control */
      {
        /* This kind of transfer on control endpoints other than EP0 are not
         * currently supported
         */

        return -ENOSYS;
      }

