GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
  /* Check for a pending ACK response received/transmitted interrupt */

  if ((pending & USBFS_HCHINTF_ACK) != 0)
    {
      /* Clear the pending the ACK response received/transmitted interrupt */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_ACK);
    }

  /* Check for a pending STALL response receive (STALL) interrupt */

  else if ((pending & USBFS_HCHINTF_STALL) != 0)
    {
      /* Clear the NAK and STALL Conditions. */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx),
                     (USBFS_HCHINTF_NAK | USBFS_HCHINTF_STALL));

      /* Halt the channel when a STALL, TXERR, BBERR or DTERR interrupt is
       * received on the channel.
       */

      gd32_chan_halt(priv, chidx, CHREASON_STALL);

      /* When there is a STALL, clear any pending NAK so that it is not
       * processed below.
       */

      pending &= ~USBFS_HCHINTF_NAK;
    }

  /* Check for a pending Data Toggle ERRor (DTERR) interrupt */

  else if ((pending & USBFS_HCHINTF_DTER) != 0)
    {
      /* Halt the channel when a STALL, TXERR, BBERR or DTERR interrupt is
       * received on the channel.
       */

      gd32_chan_halt(priv, chidx, CHREASON_DTERR);

      /* Clear the NAK and data toggle error conditions */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx),
                     (USBFS_HCHINTF_NAK | USBFS_HCHINTF_DTER));
    }

  /* Check for a pending FRaMe OverRun (FRMOR) interrupt */

  if ((pending & USBFS_HCHINTF_REQOVR) != 0)
    {
      /* Halt the channel -- the CHH interrupt is expected next */

      gd32_chan_halt(priv, chidx, CHREASON_FRMOR);

      /* Clear the FRaMe OverRun (FRMOR) condition */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_REQOVR);
    }

  /* Check for a pending TransFeR Completed (XFRC) interrupt */

  else if ((pending & USBFS_HCHINTF_TF) != 0)
    {
      /* Clear the TransFeR Completed (XFRC) condition */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_TF);

      /* Then handle the transfer completion event based on the endpoint */

      if (chan->eptype == USBFS_EPTYPE_CTRL ||
          chan->eptype == USBFS_EPTYPE_BULK)
        {
          /* Halt the channel -- the CHH interrupt is expected next */

          gd32_chan_halt(priv, chidx, CHREASON_XFRC);

          /* Clear any pending NAK condition.  The 'indata1' data toggle
           * should have been appropriately updated by the RxFIFO
           * logic as each packet was received.
           */

          gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_NAK);
        }
      else if (chan->eptype == USBFS_EPTYPE_INTR)
        {
          /* Force the next transfer on an ODD frame */

          regval = gd32_getreg(GD32_USBFS_HCHCTL(chidx));
          regval |= USBFS_HCHCTL_ODDFRM;
          gd32_putreg(GD32_USBFS_HCHCTL(chidx), regval);

          /* Set the request done state */

          chan->result = OK;
        }
    }

  /* Check for a pending CHannel Halted (CHH) interrupt */

  else if ((pending & USBFS_HCHINTF_CH) != 0)
    {
      /* Mask the CHannel Halted (CHH) interrupt */

      regval  = gd32_getreg(GD32_USBFS_HCHINTEN(chidx));
      regval &= ~USBFS_HCHINTF_CH;
      gd32_putreg(GD32_USBFS_HCHINTEN(chidx), regval);

      /* Update the request state based on the host state machine state */

      if (chan->chreason == CHREASON_XFRC)
        {
          /* Set the request done result */

          chan->result = OK;
        }
      else if (chan->chreason == CHREASON_STALL)
        {
          /* Set the request stall result */

          chan->result = EPERM;
        }
      else if ((chan->chreason == CHREASON_TXERR) ||
               (chan->chreason == CHREASON_DTERR))
        {
          /* Set the request I/O error result */

          chan->result = EIO;
        }
      else if (chan->chreason == CHREASON_NAK)
        {
          /* Set the NAK error result */

          chan->result = EAGAIN;
        }
      else /* if (chan->chreason == CHREASON_FRMOR) */
        {
          /* Set the frame overrun error result */

          chan->result = EPIPE;
        }

      /* Clear the CHannel Halted (CHH) condition */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_CH);
    }

  /* Check for a pending Transaction ERror (TXERR) interrupt */

  else if ((pending & USBFS_HCHINTF_USBER) != 0)
    {
      /* Halt the channel when a STALL, TXERR, BBERR or DTERR interrupt is
       * received on the channel.
       */

      gd32_chan_halt(priv, chidx, CHREASON_TXERR);

      /* Clear the Transaction ERror (TXERR) condition */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_USBER);
    }

  /* Check for a pending NAK response received (NAK) interrupt */

  else if ((pending & USBFS_HCHINTF_NAK) != 0)
    {
      /* For a BULK transfer, the hardware is capable of retrying
       * automatically on a NAK.  However, this is not always
       * what we need to do.  So we always halt the transfer and
       * return control to high level logic in the event of a NAK.
       */

      /* Halt the interrupt channel */

      if (chan->eptype == USBFS_EPTYPE_INTR ||
          chan->eptype == USBFS_EPTYPE_BULK)
        {
          /* Halt the channel -- the CHH interrupt is expected next */

          gd32_chan_halt(priv, chidx, CHREASON_NAK);
        }

      /* Re-activate CTRL and BULK channels.
       *
       * This can cause a lot of interrupts!
       * Bulk endpoints not re-activated.
       */

      else if (chan->eptype == USBFS_EPTYPE_CTRL)
        {
          /* Re-activate the channel by clearing CHDIS and assuring that
           * CHENA is set
           *
           * Set channel reason to NACK?
           */

          regval  = gd32_getreg(GD32_USBFS_HCHCTL(chidx));
          regval |= USBFS_HCHCTL_CEN;
          regval &= ~USBFS_HCHCTL_CDIS;
          gd32_putreg(GD32_USBFS_HCHCTL(chidx), regval);
        }

      /* Clear the NAK condition */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_NAK);
    }

  /* Check for a transfer complete event */

  gd32_chan_wakeup(priv, chan);
}

/****************************************************************************
 * Name: gd32_gint_hcoutisr
 *
 * Description:
 *   USB USBFS host OUT channels interrupt handler
 *
 *   One the completion of the transfer, the channel result byte may be set
 *   as follows:
 *
 *     OK     - Transfer completed successfully
 *     EAGAIN - If devices NAKs the transfer or NYET occurs
 *     EPERM  - If the endpoint stalls
 *     EIO    - On a TX or data toggle error
 *     EPIPE  - Frame overrun
 *
 *   EBUSY in the result field indicates that the transfer has not completed.
 *
 ****************************************************************************/

