GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
static inline void gd32_gint_hcoutisr(struct gd32_usbhost_s *priv,
                                         int chidx)
{
  struct gd32_chan_s *chan = &priv->chan[chidx];
  uint32_t regval;
  uint32_t pending;

  /* Read the HCINT register to get the pending HC interrupts.  Read the
   * HCINTMSK register to get the set of enabled HC interrupts.
   */

  pending = gd32_getreg(GD32_USBFS_HCHINTF(chidx));
  regval  = gd32_getreg(GD32_USBFS_HCHINTEN(chidx));

  /* AND the two to get the set of enabled, pending HC interrupts */

  pending &= regval;
    uinfo("HCINTMSK%d: %08" PRIx32 " pending: %08" PRIx32 "\n",
      chidx, regval, pending);

  /* Check for a pending ACK response received/transmitted interrupt */

  if ((pending & USBFS_HCHINTF_ACK) != 0)
    {
      /* Clear the pending the ACK response received/transmitted interrupt */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_ACK);
    }

  /* Check for a pending FRaMe OverRun (FRMOR) interrupt */

  else if ((pending & USBFS_HCHINTF_REQOVR) != 0)
    {
      /* Halt the channel (probably not necessary for FRMOR) */

      gd32_chan_halt(priv, chidx, CHREASON_FRMOR);

      /* Clear the pending the FRaMe OverRun (FRMOR) interrupt */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_REQOVR);
    }

  /* Check for a pending TransFeR Completed (XFRC) interrupt */

  else if ((pending & USBFS_HCHINTF_TF) != 0)
    {
      /* Decrement the number of bytes remaining by the number of
       * bytes that were "in-flight".
       */

      priv->chan[chidx].buffer  += priv->chan[chidx].inflight;
      priv->chan[chidx].xfrd    += priv->chan[chidx].inflight;
      priv->chan[chidx].inflight = 0;

      /* Halt the channel -- the CHH interrupt is expected next */

      gd32_chan_halt(priv, chidx, CHREASON_XFRC);

      /* Clear the pending the TransFeR Completed (XFRC) interrupt */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_TF);
    }

  /* Check for a pending STALL response receive (STALL) interrupt */

  else if ((pending & USBFS_HCHINTF_STALL) != 0)
    {
      /* Clear the pending STALL response receive (STALL) interrupt */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_STALL);

      /* Halt the channel when a STALL, TXERR, BBERR or DTERR interrupt is
       * received on the channel.
       */

      gd32_chan_halt(priv, chidx, CHREASON_STALL);
    }

  /* Check for a pending NAK response received (NAK) interrupt */

  else if ((pending & USBFS_HCHINTF_NAK) != 0)
    {
      /* Halt the channel  -- the CHH interrupt is expected next */

      gd32_chan_halt(priv, chidx, CHREASON_NAK);

      /* Clear the pending the NAK response received (NAK) interrupt */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_NAK);
    }

  /* Check for a pending Transaction ERror (TXERR) interrupt */

  else if ((pending & USBFS_HCHINTF_USBER) != 0)
    {
      /* Halt the channel when a STALL, TXERR, BBERR or DTERR interrupt is
       * received on the channel.
       */

      gd32_chan_halt(priv, chidx, CHREASON_TXERR);

      /* Clear the pending the Transaction ERror (TXERR) interrupt */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_USBER);
    }

  /* Check for a NYET interrupt */

  /* Check for a pending Data Toggle ERRor (DTERR) interrupt */

  else if (pending & USBFS_HCHINTF_DTER)
    {
      /* Halt the channel when a STALL, TXERR, BBERR or DTERR interrupt is
       * received on the channel.
       */

      gd32_chan_halt(priv, chidx, CHREASON_DTERR);

      /* Clear the pending the Data Toggle ERRor (DTERR) and NAK interrupts */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx),
                     (USBFS_HCHINTF_DTER | USBFS_HCHINTF_NAK));
    }

  /* Check for a pending CHannel Halted (CHH) interrupt */

  else if ((pending & USBFS_HCHINTF_CH) != 0)
    {
      /* Mask the CHannel Halted (CHH) interrupt */

      regval  = gd32_getreg(GD32_USBFS_HCHINTEN(chidx));
      regval &= ~USBFS_HCHINTF_CH;
      gd32_putreg(GD32_USBFS_HCHINTEN(chidx), regval);

      if (chan->chreason == CHREASON_XFRC)
        {
          /* Set the request done result */

          chan->result = OK;

          /* Read the HCCHAR register to get the HCCHAR register to get
           * the endpoint type.
           */

          regval = gd32_getreg(GD32_USBFS_HCHCTL(chidx));

          /* Is it a bulk endpoint?  Were an odd number of packets
           * transferred?
           */

          if ((regval & USBFS_HCHCTL_EPTYPE_MASK) ==
              USBFS_HCHCTL_EPTYPE_BULK &&
              (chan->npackets & 1) != 0)
            {
              /* Yes to both... toggle the data out PID */

              chan->outdata1 ^= true;
            }
        }
      else if (chan->chreason == CHREASON_NAK ||
               chan->chreason == CHREASON_NYET)
        {
          /* Set the try again later result */

          chan->result = EAGAIN;
        }
      else if (chan->chreason == CHREASON_STALL)
        {
          /* Set the request stall result */

          chan->result = EPERM;
        }
      else if ((chan->chreason == CHREASON_TXERR) ||
               (chan->chreason == CHREASON_DTERR))
        {
          /* Set the I/O failure result */

          chan->result = EIO;
        }
      else /* if (chan->chreason == CHREASON_FRMOR) */
        {
          /* Set the frame error result */

          chan->result = EPIPE;
        }

      /* Clear the pending the CHannel Halted (CHH) interrupt */

      gd32_putreg(GD32_USBFS_HCHINTF(chidx), USBFS_HCHINTF_CH);
    }

  /* Check for a transfer complete event */

  gd32_chan_wakeup(priv, chan);
}

/****************************************************************************
 * Name: gd32_gint_connected
 *
 * Description:
 *   Handle a connection event.
 *
 ****************************************************************************/

static void gd32_gint_connected(struct gd32_usbhost_s *priv)
{
  /* We we previously disconnected? */

  if (!priv->connected)
    {
      /* Yes.. then now we are connected */

