GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
      usbhost_vtrace1(USBFS_VTRACE1_CONNECTED, 0);
      priv->connected = true;
      priv->change    = true;
      DEBUGASSERT(priv->smstate == SMSTATE_DETACHED);

      /* Notify any waiters */

      priv->smstate = SMSTATE_ATTACHED;
      if (priv->pscwait)
        {
          nxsem_post(&priv->pscsem);
          priv->pscwait = false;
        }
    }
}

/****************************************************************************
 * Name: gd32_gint_disconnected
 *
 * Description:
 *   Handle a disconnection event.
 *
 ****************************************************************************/

static void gd32_gint_disconnected(struct gd32_usbhost_s *priv)
{
  /* Were we previously connected? */

  if (priv->connected)
    {
      /* Yes.. then we no longer connected */

      usbhost_vtrace1(USBFS_VTRACE1_DISCONNECTED, 0);

      /* Are we bound to a class driver? */

      if (priv->rhport.hport.devclass)
        {
          /* Yes.. Disconnect the class driver */

          CLASS_DISCONNECTED(priv->rhport.hport.devclass);
          priv->rhport.hport.devclass = NULL;
        }

      /* Re-Initialize Host for new Enumeration */

      priv->smstate   = SMSTATE_DETACHED;
      priv->connected = false;
      priv->change    = true;

      /* Free the EP0 control channels (indices 0 and 1) which are
       * skipped by gd32_chan_freeall().
       */

      gd32_chan_free(priv, priv->ep0.outndx);
      gd32_chan_free(priv, priv->ep0.inndx);
      gd32_chan_freeall(priv);

      priv->rhport.hport.speed = USB_SPEED_FULL;
      priv->rhport.hport.funcaddr = 0;

      /* Notify any waiters that there is a change in the connection state */

      if (priv->pscwait)
        {
          nxsem_post(&priv->pscsem);
          priv->pscwait = false;
        }
    }
}

/****************************************************************************
 * Name: gd32_gint_sofisr
 *
 * Description:
 *   USBFS start-of-frame interrupt handler
 *
 ****************************************************************************/

#ifdef CONFIG_GD32E11X_USBFS_SOFINTR
static inline void gd32_gint_sofisr(struct gd32_usbhost_s *priv)
{
  /* Handle SOF interrupt */

  /* Clear pending SOF interrupt */

  gd32_putreg(GD32_USBFS_GINTF, USBFS_GINTF_SOF);
}
#endif

/****************************************************************************
 * Name: gd32_gint_rxflvlisr
 *
 * Description:
 *   USBFS RxFIFO non-empty interrupt handler
 *
 ****************************************************************************/

static inline void gd32_gint_rxflvlisr(struct gd32_usbhost_s *priv)
{
  uint32_t *dest;
  uint32_t grxsts;
  uint32_t intmsk;
  uint32_t hcchar;
  uint32_t hctsiz;
  uint32_t fifo;
  int bcnt;
  int bcnt32;
  int chidx;
  int i;

  /* Disable the RxFIFO non-empty interrupt */

  intmsk  = gd32_getreg(GD32_USBFS_GINTEN);
  intmsk &= ~USBFS_GINTF_RXFNEIF;
  gd32_putreg(GD32_USBFS_GINTEN, intmsk);

  /* Read and pop the next status from the Rx FIFO */

  grxsts = gd32_getreg(GD32_USBFS_GRSTATP);
  uinfo("GRXSTS: %08" PRIx32 "\n", grxsts);

  /* Isolate the channel number/index in the status word */

  chidx = (grxsts & USBFS_GRXSTAH_CNUM_MASK) >> USBFS_GRXSTAH_CNUM_SHIFT;

  /* Get the host channel characteristics register (HCCHAR) */

  hcchar = gd32_getreg(GD32_USBFS_HCHCTL(chidx));

  /* Then process the interrupt according to the packet status */

  switch (grxsts & USBFS_GRXSTAH_RPCKST_MASK)
    {
    case USBFS_GRXSTAH_RPCKST_INRECVD: /* IN data packet received */
      {
        /* Read the data into the host buffer. */

        bcnt = (grxsts & USBFS_GRXSTAH_BCOUNT_MASK) >>
               USBFS_GRXSTAH_BCOUNT_SHIFT;
        if (bcnt > 0 && priv->chan[chidx].buffer != NULL)
          {
            /* Verify that the received data fits in the user buffer */

            if (priv->chan[chidx].xfrd + bcnt > priv->chan[chidx].buflen)
              {
                bcnt = priv->chan[chidx].buflen - priv->chan[chidx].xfrd;
              }

            /* Transfer the packet from the Rx FIFO into the user buffer */

            dest   = (uint32_t *)priv->chan[chidx].buffer;
            fifo   = GD32_USBFS_DFIFO_HCH(0);
            bcnt32 = (bcnt + 3) >> 2;

            for (i = 0; i < bcnt32; i++)
              {
                *dest++ = gd32_getreg(fifo);
              }

            gd32_pktdump("Received", priv->chan[chidx].buffer, bcnt);

            /* Toggle the IN data pid (Used by Bulk and INTR only) */

            priv->chan[chidx].indata1 ^= true;

            /* Manage multiple packet transfers */

            priv->chan[chidx].buffer += bcnt;
            priv->chan[chidx].xfrd   += bcnt;

            /* Check if more packets are expected */

            hctsiz = gd32_getreg(GD32_USBFS_HCHLEN(chidx));
            if ((hctsiz & USBFS_HCHLEN_PCNT_MASK) != 0)
              {
                /* Re-activate the channel when more packets are expected */

                hcchar |= USBFS_HCHCTL_CEN;
                hcchar &= ~USBFS_HCHCTL_CDIS;
                gd32_putreg(GD32_USBFS_HCHCTL(chidx), hcchar);
              }
          }
      }
      break;

    case USBFS_GRXSTAH_RPCKST_INDONE:  /* IN transfer completed */
    case USBFS_GRXSTAH_RPCKST_DTOGERR: /* Data toggle error */
    case USBFS_GRXSTAH_RPCKST_HALTED:  /* Channel halted */
    default:
      break;
    }

  /* Re-enable the RxFIFO non-empty interrupt */

  intmsk |= USBFS_GINTF_RXFNEIF;
  gd32_putreg(GD32_USBFS_GINTEN, intmsk);
}

/****************************************************************************
 * Name: gd32_gint_nptxfeisr
 *
 * Description:
 *   USBFS non-periodic TxFIFO empty interrupt handler
 *
 ****************************************************************************/

static inline void gd32_gint_nptxfeisr(struct gd32_usbhost_s *priv)
{
  struct gd32_chan_s *chan;
  uint32_t     regval;
  unsigned int wrsize;
  unsigned int avail;
  unsigned int chidx;

  /* Recover the index of the channel that is waiting for space in the Tx
   * FIFO.
   */

  chidx = priv->chidx;
  chan  = &priv->chan[chidx];

  /* Reduce the buffer size by the number of bytes that were previously
   * placed in the Tx FIFO.
   */

  chan->buffer  += chan->inflight;
  chan->xfrd    += chan->inflight;
  chan->inflight = 0;

  /* If we have now transferred the entire buffer, then this transfer is
   * complete (this case really should never happen because we disable
   * the NPTXFE interrupt on the final packet).
   */

  if (chan->xfrd >= chan->buflen)
    {
      /* Disable further Tx FIFO empty interrupts and bail. */

      gd32_modifyreg(GD32_USBFS_GINTEN, USBFS_GINTF_NPTXFEIF, 0);
      return;
    }

  /* Read the status from the top of the non-periodic TxFIFO */

  regval = gd32_getreg(GD32_USBFS_HNPTFQSTAT);

