GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
  /* Extract the number of bytes available in the non-periodic Tx FIFO. */

  avail = ((regval & USBFS_HNPTFQSTAT_NPTXFS_MASK) >>
           USBFS_HNPTFQSTAT_NPTXFS_SHIFT) << 2;

  /* Get the size to put in the Tx FIFO now */

  wrsize = chan->buflen - chan->xfrd;

  /* Get minimal size packet that can be sent.  Something is seriously
   * configured wrong if one packet will not fit into the empty Tx FIFO.
   */

  DEBUGASSERT(wrsize > 0 && avail >= MIN(wrsize, chan->maxpacket));
  if (wrsize > avail)
    {
      /* Clip the write size to the number of full, max sized packets
       * that will fit in the Tx FIFO.
       */

      unsigned int wrpackets = avail / chan->maxpacket;
      wrsize = wrpackets * chan->maxpacket;
    }

  /* Otherwise, this will be the last packet to be sent in this transaction.
   * We now need to disable further NPTXFE interrupts.
   */

  else
    {
      gd32_modifyreg(GD32_USBFS_GINTEN, USBFS_GINTF_NPTXFEIF, 0);
    }

  /* Write the next group of packets into the Tx FIFO */

  uinfo("HNPTXSTS: %08" PRIx32 " chidx: %d avail: %d buflen: %d xfrd: %d "
        "wrsize: %d\n",
        regval, chidx, avail, chan->buflen, chan->xfrd, wrsize);

  gd32_gint_wrpacket(priv, chan->buffer, chidx, wrsize);
}

/****************************************************************************
 * Name: gd32_gint_ptxfeisr
 *
 * Description:
 *   USBFS periodic TxFIFO empty interrupt handler
 *
 ****************************************************************************/

static inline void gd32_gint_ptxfeisr(struct gd32_usbhost_s *priv)
{
  struct gd32_chan_s *chan;
  uint32_t     regval;
  unsigned int wrsize;
  unsigned int avail;
  unsigned int chidx;

  /* Recover the index of the channel that is waiting for space in the Tx
   * FIFO.
   */

  chidx = priv->chidx;
  chan  = &priv->chan[chidx];

  /* Reduce the buffer size by the number of bytes that were previously
   * placed in the Tx FIFO.
   */

  chan->buffer  += chan->inflight;
  chan->xfrd    += chan->inflight;
  chan->inflight = 0;

  /* If we have now transferred the entire buffer, then this transfer is
   * complete (this case really should never happen because we disable
   * the PTXFE interrupt on the final packet).
   */

  if (chan->xfrd >= chan->buflen)
    {
      /* Disable further Tx FIFO empty interrupts and bail. */

      gd32_modifyreg(GD32_USBFS_GINTEN, USBFS_GINTF_PTXFEIF, 0);
      return;
    }

  /* Read the status from the top of the periodic TxFIFO */

  regval = gd32_getreg(GD32_USBFS_HPTFQSTAT);

  /* Extract the number of bytes available in the periodic Tx FIFO. */

  avail = ((regval & USBFS_HPTFQSTAT_PTXFS_MASK) >>
           USBFS_HPTFQSTAT_PTXFS_SHIFT) << 2;

  /* Get the size to put in the Tx FIFO now */

  wrsize = chan->buflen - chan->xfrd;

  /* Get minimal size packet that can be sent.  Something is seriously
   * configured wrong if one packet will not fit into the empty Tx FIFO.
   */

  DEBUGASSERT(wrsize && avail >= MIN(wrsize, chan->maxpacket));
  if (wrsize > avail)
    {
      /* Clip the write size to the number of full, max sized packets
       * that will fit in the Tx FIFO.
       */

      unsigned int wrpackets = avail / chan->maxpacket;
      wrsize = wrpackets * chan->maxpacket;
    }

  /* Otherwise, this will be the last packet to be sent in this transaction.
   * We now need to disable further PTXFE interrupts.
   */

  else
    {
      gd32_modifyreg(GD32_USBFS_GINTEN, USBFS_GINTF_PTXFEIF, 0);
    }

  /* Write the next group of packets into the Tx FIFO */

    uinfo("HPTXSTS: %08" PRIx32 " chidx: %d avail: %d buflen: %d "
      "xfrd: %d wrsize: %d\n",
      regval, chidx, avail, chan->buflen, chan->xfrd, wrsize);

  gd32_gint_wrpacket(priv, chan->buffer, chidx, wrsize);
}

/****************************************************************************
 * Name: gd32_gint_hcisr
 *
 * Description:
 *   USB USBFS host channels interrupt handler
 *
 ****************************************************************************/

static inline void gd32_gint_hcisr(struct gd32_usbhost_s *priv)
{
  uint32_t haint;
  uint32_t hcchar;
  int i = 0;

  /* Read the Host all channels interrupt register and test each bit in the
   * register. Each bit i, i=0...(GD32_NHOST_CHANNELS-1), corresponds to
   * a pending interrupt on channel i.
   */

  haint = gd32_getreg(GD32_USBFS_HACHINT);
  for (i = 0; i < GD32_NHOST_CHANNELS; i++)
    {
      /* Is an interrupt pending on this channel? */

      if ((haint & USBFS_HACHINT(i)) != 0)
        {
          /* Yes... read the HCCHAR register to get the direction bit */

          hcchar = gd32_getreg(GD32_USBFS_HCHCTL(i));

          /* Was this an interrupt on an IN or an OUT channel? */

          if ((hcchar & USBFS_HCHCTL_EPDIR) != 0)
            {
              /* Handle the HC IN channel interrupt */

              gd32_gint_hcinisr(priv, i);
            }
          else
            {
              /* Handle the HC OUT channel interrupt */

              gd32_gint_hcoutisr(priv, i);
            }
        }
    }
}

/****************************************************************************
 * Name: gd32_gint_hprtisr
 *
 * Description:
 *   USB USBFS host port interrupt handler
 *
 ****************************************************************************/

static inline void gd32_gint_hprtisr(struct gd32_usbhost_s *priv)
{
  uint32_t hprt;
  uint32_t newhprt;
  uint32_t hcfg;

  usbhost_vtrace1(USBFS_VTRACE1_GINT_HPRT, 0);

  /* Read the port status and control register (HPRT) */

  hprt = gd32_getreg(GD32_USBFS_HPCS);

  /* Setup to clear the interrupt bits in GINTSTS by setting the
   * corresponding bits in the HPRT.  The HCINT interrupt bit is cleared
   * when the appropriate status bits in the HPRT register are cleared.
   */

  newhprt = hprt & ~(USBFS_HPCS_PE | USBFS_HPCS_PCD | USBFS_HPCS_PEDC);

  /* Check for Port Connect DETected (PCDET).  The core sets this bit when a
   * device connection is detected.
   */

  if ((hprt & USBFS_HPCS_PCD) != 0)
    {
      /* Set up to clear the PCDET status in the new HPRT contents. Then
       * process the new connection event.
       */

