GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
      usbhost_vtrace1(USBFS_VTRACE1_GINT_HPRT_PCDET, 0);
      newhprt |= USBFS_HPCS_PCD;
      gd32_portreset(priv);
      gd32_gint_connected(priv);
    }

  /* Check for Port Enable CHaNGed (PENCHNG) */

  if ((hprt & USBFS_HPCS_PEDC) != 0)
    {
      /* Set up to clear the PENCHNG status in the new HPRT contents. */

      usbhost_vtrace1(USBFS_VTRACE1_GINT_HPRT_PENCHNG, 0);
      newhprt |= USBFS_HPCS_PEDC;

      /* Was the port enabled? */

      if ((hprt & USBFS_HPCS_PE) != 0)
        {
          /* Yes.. handle the new connection event */

          gd32_gint_connected(priv);

          /* Check the Host ConFiGuration register (HCFG) */

          hcfg = gd32_getreg(GD32_USBFS_HCTL);

          /* Is this a low speed or full speed connection (USBFS does not
           * support high speed)
           */

          if ((hprt & USBFS_HPCS_PS_MASK) == USBFS_HPCS_PS_LS)
            {
              /* Set the Host Frame Interval Register for the 6KHz speed */

              usbhost_vtrace1(USBFS_VTRACE1_GINT_HPRT_LSDEV, 0);
              gd32_putreg(GD32_USBFS_HFT, 6000);

              /* Are we switching from FS to LS? */

              if ((hcfg & USBFS_HCTL_CLKSEL_MASK) !=
                  USBFS_HCTL_CLKSEL_LS6MHz)
                {
                  usbhost_vtrace1(USBFS_VTRACE1_GINT_HPRT_FSLSSW, 0);

                  /* Yes... configure for LS */

                  hcfg &= ~USBFS_HCTL_CLKSEL_MASK;
                  hcfg |= USBFS_HCTL_CLKSEL_LS6MHz;
                  gd32_putreg(GD32_USBFS_HCTL, hcfg);

                  /* And reset the port */

                  gd32_portreset(priv);
                }
            }
          else /* if ((hprt & USBFS_HPCS_PS_MASK) == USBFS_HPCS_PS_FS) */
            {
              usbhost_vtrace1(USBFS_VTRACE1_GINT_HPRT_FSDEV, 0);
              gd32_putreg(GD32_USBFS_HFT, 48000);

              /* Are we switching from LS to FS? */

              if ((hcfg & USBFS_HCTL_CLKSEL_MASK) !=
                  USBFS_HCTL_CLKSEL_FS48MHz)
                {
                  usbhost_vtrace1(USBFS_VTRACE1_GINT_HPRT_LSFSSW, 0);

                  /* Yes... configure for FS */

                  hcfg &= ~USBFS_HCTL_CLKSEL_MASK;
                  hcfg |= USBFS_HCTL_CLKSEL_FS48MHz;
                  gd32_putreg(GD32_USBFS_HCTL, hcfg);

                  /* And reset the port */

                  gd32_portreset(priv);
                }
            }
        }
    }

  /* Clear port interrupts by setting bits in the HPRT */

  gd32_putreg(GD32_USBFS_HPCS, newhprt);
}

/****************************************************************************
 * Name: gd32_gint_discisr
 *
 * Description:
 *   USBFS disconnect detected interrupt handler
 *
 ****************************************************************************/

static inline void gd32_gint_discisr(struct gd32_usbhost_s *priv)
{
  /* Handle the disconnection event */

  gd32_gint_disconnected(priv);

  /* Clear the dicsonnect interrupt */

  gd32_putreg(GD32_USBFS_GINTF, USBFS_GINTF_DISCIF);
}

/****************************************************************************
 * Name: gd32_gint_ipxfrisr
 *
 * Description:
 *   USBFS incomplete periodic interrupt handler
 *
 ****************************************************************************/

static inline void gd32_gint_ipxfrisr(struct gd32_usbhost_s *priv)
{
  uint32_t regval;

  /* CHENA : Set to enable the channel
   * CHDIS : Set to stop transmitting/receiving data on a channel
   */

  regval = gd32_getreg(GD32_USBFS_HCHCTL(0));
  regval |= (USBFS_HCHCTL_CDIS | USBFS_HCHCTL_CEN);
  gd32_putreg(GD32_USBFS_HCHCTL(0), regval);

  /* Clear the incomplete isochronous OUT interrupt */

  gd32_putreg(GD32_USBFS_GINTF, USBFS_GINTF_PXNCIF_ISOONCIF);
}

/****************************************************************************
 * Name: gd32_gint_isr
 *
 * Description:
 *   USBFS global interrupt handler
 *
 ****************************************************************************/

static int gd32_gint_isr(int irq, void *context, void *arg)
{
  /* At present, there is only support for a single USBFS host. Hence it is
   * pre-allocated as g_usbhost.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct gd32_usbhost_s *priv = &g_usbhost;
  uint32_t pending;

  /* If OTG were supported, we would need to check if we are in host or
   * device mode when the global interrupt occurs.  Here we support only
   * host mode
   */

  /* Loop while there are pending interrupts to process.  This loop may save
   * a little interrupt handling overhead.
   */

  for (; ; )
    {
      /* Get the unmasked bits in the GINT status */

      pending  = gd32_getreg(GD32_USBFS_GINTF);
      pending &= gd32_getreg(GD32_USBFS_GINTEN);

      /* Return from the interrupt when there are no further pending
       * interrupts.
       */

      if (pending == 0)
        {
          return OK;
        }

      /* Otherwise, process each pending, unmasked GINT interrupts */

      /* Handle the start of frame interrupt */

#ifdef CONFIG_GD32E11X_USBFS_SOFINTR
      if ((pending & USBFS_GINTF_SOF) != 0)
        {
          usbhost_vtrace1(USBFS_VTRACE1_GINT_SOF, 0);
          gd32_gint_sofisr(priv);
        }
#endif

      /* Handle the RxFIFO non-empty interrupt */

      if ((pending & USBFS_GINTF_RXFNEIF) != 0)
        {
          usbhost_vtrace1(USBFS_VTRACE1_GINT_RXFLVL, 0);
          gd32_gint_rxflvlisr(priv);
        }

      /* Handle the non-periodic TxFIFO empty interrupt */

      if ((pending & USBFS_GINTF_NPTXFEIF) != 0)
        {
          usbhost_vtrace1(USBFS_VTRACE1_GINT_NPTXFE, 0);
          gd32_gint_nptxfeisr(priv);
        }

      /* Handle the periodic TxFIFO empty interrupt */

      if ((pending & USBFS_GINTF_PTXFEIF) != 0)
        {
          usbhost_vtrace1(USBFS_VTRACE1_GINT_PTXFE, 0);
          gd32_gint_ptxfeisr(priv);
        }

      /* Handle the host channels interrupt */

