GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
      if ((pending & USBFS_GINTF_HCIF) != 0)
        {
          usbhost_vtrace1(USBFS_VTRACE1_GINT_HC, 0);
          gd32_gint_hcisr(priv);
        }

      /* Handle the host port interrupt */

      if ((pending & USBFS_GINTF_HPIF) != 0)
        {
          gd32_gint_hprtisr(priv);
        }

      /* Handle the disconnect detected interrupt */

      if ((pending & USBFS_GINTF_DISCIF) != 0)
        {
          usbhost_vtrace1(USBFS_VTRACE1_GINT_DISC, 0);
          gd32_gint_discisr(priv);
        }

      /* Handle the incomplete periodic transfer */

      if ((pending & USBFS_GINTF_PXNCIF_ISOONCIF) != 0)
        {
          usbhost_vtrace1(USBFS_VTRACE1_GINT_IPXFR, 0);
          gd32_gint_ipxfrisr(priv);
        }
    }

  /* We won't get here */

  return OK;
}

/****************************************************************************
 * Name: gd32_gint_enable and gd32_gint_disable
 *
 * Description:
 *   Respectively enable or disable the global USBFS interrupt.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void gd32_gint_enable(void)
{
  uint32_t regval;

  /* Set the GINTMSK bit to unmask the interrupt */

  regval  = gd32_getreg(GD32_USBFS_GAHBCS);
  regval |= USBFS_GAHBCS_GINTEN;
  gd32_putreg(GD32_USBFS_GAHBCS, regval);
}

static void gd32_gint_disable(void)
{
  uint32_t regval;

  /* Clear the GINTMSK bit to mask the interrupt */

  regval  = gd32_getreg(GD32_USBFS_GAHBCS);
  regval &= ~USBFS_GAHBCS_GINTEN;
  gd32_putreg(GD32_USBFS_GAHBCS, regval);
}

/****************************************************************************
 * Name: gd32_hostinit_enable
 *
 * Description:
 *   Enable host interrupts.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void gd32_hostinit_enable(void)
{
  uint32_t regval;

  /* Disable all interrupts. */

  gd32_putreg(GD32_USBFS_GINTEN, 0);

  /* Clear any pending interrupts. */

  gd32_putreg(GD32_USBFS_GINTF, 0xffffffff);

  /* Clear any pending USB OTG Interrupts */

  gd32_putreg(GD32_USBFS_GOTGINTF, 0xffffffff);

  /* Clear any pending USB OTG interrupts */

  gd32_putreg(GD32_USBFS_GINTF, 0xbfffffff);

  /* Enable the host interrupts */

  /* Common interrupts:
   *
   *   USBFS_GINTF_WKUPIF     : Resume/remote wakeup detected interrupt
   *   USBFS_GINTF_SP  : USB suspend
   */

  regval = (USBFS_GINTF_WKUPIF | USBFS_GINTF_SP);

  /* If OTG were supported, we would need to enable the following as well:
   *
   *   USBFS_GINTF_OTGIF      : OTG interrupt
   *   USBFS_GINTF_SESIF      : Session request/new session detected
   *                            interrupt
   *   USBFS_GINTF_IDPSC  : Connector ID status change
   */

  /* Host-specific interrupts
   *
   *   USBFS_GINTF_SOF      : Start of frame
   *   USBFS_GINTF_RXFNEIF   : RxFIFO non-empty
   *   USBFS_GINTF_PXNCIF_ISOONCIF : Incomplete isochronous OUT transfer
   *   USBFS_GINTF_HPIF     : Host port interrupt
   *   USBFS_GINTF_HCIF       : Host channels interrupt
   *   USBFS_GINTF_DISCIF     : Disconnect detected interrupt
   */

#ifdef CONFIG_GD32E11X_USBFS_SOFINTR
  regval |= (USBFS_GINTF_SOF | USBFS_GINTF_RXFNEIF |
             USBFS_GINTF_PXNCIF_ISOONCIF | USBFS_GINTF_HPIF |
             USBFS_GINTF_HCIF | USBFS_GINTF_DISCIF);
#else
  regval |= (USBFS_GINTF_RXFNEIF | USBFS_GINTF_PXNCIF_ISOONCIF |
             USBFS_GINTF_HPIF | USBFS_GINTF_HCIF |
             USBFS_GINTF_DISCIF);
#endif
  gd32_putreg(GD32_USBFS_GINTEN, regval);
}

/****************************************************************************
 * Name: gd32_txfe_enable
 *
 * Description:
 *   Enable Tx FIFO empty interrupts.  This is necessary when the entire
 *   transfer will not fit into Tx FIFO.  The transfer will then be completed
 *   when the Tx FIFO is empty.  NOTE:  The Tx FIFO interrupt is disabled
 *   the fifo empty interrupt handler when the transfer is complete.
 *
 * Input Parameters:
 *   priv - Driver state structure reference
 *   chidx - The channel that requires the Tx FIFO empty interrupt
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called from user task context.  Interrupts must be disabled to assure
 *   exclusive access to the GINTMSK register.
 *
 ****************************************************************************/

static void gd32_txfe_enable(struct gd32_usbhost_s *priv,
                                int chidx)
{
  struct gd32_chan_s *chan = &priv->chan[chidx];
  irqstate_t flags;
  uint32_t regval;

  /* Disable all interrupts so that we have exclusive access to the GINTMSK
   * (it would be sufficient just to disable the GINT interrupt).
   */

  flags = enter_critical_section();

  /* Should we enable the periodic or non-peridic Tx FIFO empty interrupts */

  regval = gd32_getreg(GD32_USBFS_GINTEN);
  switch (chan->eptype)
    {
    default:
    case USBFS_EPTYPE_CTRL: /* Non periodic transfer */
    case USBFS_EPTYPE_BULK:
      regval |= USBFS_GINTF_NPTXFEIF;
      break;

    case USBFS_EPTYPE_INTR: /* Periodic transfer */
    case USBFS_EPTYPE_ISOC:
      regval |= USBFS_GINTF_PTXFEIF;
      break;
    }

  /* Enable interrupts */

  gd32_putreg(GD32_USBFS_GINTEN, regval);
  leave_critical_section(flags);
}

/****************************************************************************
 * USB Host Controller Operations
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_wait
 *
 * Description:
 *   Wait for a device to be connected or disconnected to/from a hub port.
 *
 * Input Parameters:
 *   conn - The USB host connection instance obtained as a parameter from
 *      the call to the USB driver initialization logic.
 *   hport - The location to return the hub port descriptor that detected the
 *      connection related event.
 *
 * Returned Value:
 *   Zero (OK) is returned on success when a device is connected or
 *   disconnected. This function will not return until either (1) a device is
 *   connected or disconnect to/from any hub port or until (2) some failure
 *   occurs.  On a failure, a negated errno value is returned indicating the
 *   nature of the failure
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

