GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
  up_mdelay(20);

  regval &= ~USBFS_HPCS_PRST;
  gd32_putreg(GD32_USBFS_HPCS, regval);

  up_mdelay(20);
}

/****************************************************************************
 * Name: gd32_flush_txfifos
 *
 * Description:
 *   Flush the selected Tx FIFO.
 *
 * Input Parameters:
 *   txfnum -- USB host driver private data structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void gd32_flush_txfifos(uint32_t txfnum)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the TX FIFO flush operation */

  regval = USBFS_GRSTCTL_TXFF | txfnum;
  gd32_putreg(GD32_USBFS_GRSTCTL, regval);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < GD32_FLUSH_DELAY; timeout++)
    {
      regval = gd32_getreg(GD32_USBFS_GRSTCTL);
      if ((regval & USBFS_GRSTCTL_TXFF) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
}

/****************************************************************************
 * Name: gd32_flush_rxfifo
 *
 * Description:
 *   Flush the Rx FIFO.
 *
 * Input Parameters:
 *   priv -- USB host driver private data structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void gd32_flush_rxfifo(void)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the RX FIFO flush operation */

  gd32_putreg(GD32_USBFS_GRSTCTL, USBFS_GRSTCTL_RXFF);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < GD32_FLUSH_DELAY; timeout++)
    {
      regval = gd32_getreg(GD32_USBFS_GRSTCTL);
      if ((regval & USBFS_GRSTCTL_RXFF) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
}

/****************************************************************************
 * Name: gd32_vbusdrive
 *
 * Description:
 *   Drive the Vbus +5V.
 *
 * Input Parameters:
 *   priv  - USB host driver private data structure.
 *   state - True: Drive, False: Don't drive
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void gd32_vbusdrive(struct gd32_usbhost_s *priv, bool state)
{
  uint32_t regval;

  /* Enable/disable the external charge pump */

  gd32_usbhost_vbusdrive(0, state);

  /* Turn on the Host port power. */

  regval = gd32_getreg(GD32_USBFS_HPCS);
  regval &= ~(USBFS_HPCS_PE | USBFS_HPCS_PCD | USBFS_HPCS_PEDC);

  if (((regval & USBFS_HPCS_PP) == 0) && state)
    {
      regval |= USBFS_HPCS_PP;
      gd32_putreg(GD32_USBFS_HPCS, regval);
    }

  if (((regval & USBFS_HPCS_PP) != 0) && !state)
    {
      regval &= ~USBFS_HPCS_PP;
      gd32_putreg(GD32_USBFS_HPCS, regval);
    }

  up_mdelay(200);
}

/****************************************************************************
 * Name: gd32_host_initialize
 *
 * Description:
 *   Initialize/re-initialize hardware for host mode operation.  At present,
 *   this function is called only from gd32_hw_initialize().  But if OTG
 *   mode were supported, this function would also be called to switch
 *   between host and device modes on a connector ID change interrupt.
 *
 * Input Parameters:
 *   priv -- USB host driver private data structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void gd32_host_initialize(struct gd32_usbhost_s *priv)
{
  uint32_t regval;
  uint32_t offset;
  int i;

  /* Restart the PHY Clock */

  gd32_putreg(GD32_USBFS_PWRCLKCTL, 0);

  /* Initialize Host Configuration (HCFG) register */

  regval  = gd32_getreg(GD32_USBFS_HCTL);
  regval &= ~USBFS_HCTL_CLKSEL_MASK;
  regval |= USBFS_HCTL_CLKSEL_FS48MHz;
  gd32_putreg(GD32_USBFS_HCTL, regval);

  /* Reset the host port */

  gd32_portreset(priv);

  /* Carve up FIFO memory for the Rx FIFO and the periodic and non-periodic
   * Tx FIFOs
   */

  /* Configure Rx FIFO size (GRXFSIZ) */

  gd32_putreg(GD32_USBFS_GRFLEN, CONFIG_GD32E11X_USBFS_RXFIFO_SIZE);
  offset = CONFIG_GD32E11X_USBFS_RXFIFO_SIZE;

  /* Setup the host non-periodic Tx FIFO size (HNPTXFSIZ) */

  regval = (offset |
            (CONFIG_GD32E11X_USBFS_NPTXFIFO_SIZE <<
            USBFS_HNPTFLEN_HNPTXFD_SHIFT));
  gd32_putreg(GD32_USBFS_HNPTFLEN, regval);
  offset += CONFIG_GD32E11X_USBFS_NPTXFIFO_SIZE;

  /* Set up the host periodic Tx fifo size register (HPTXFSIZ) */

  regval = (offset |
            (CONFIG_GD32E11X_USBFS_PTXFIFO_SIZE <<
            USBFS_HPTFLEN_HPTXFD_SHIFT));
  gd32_putreg(GD32_USBFS_HPTFLEN, regval);

  /* If OTG were supported, we should need to clear HNP enable bit in the
   * USB_OTG control register about here.
   */

  /* Flush all FIFOs */

  gd32_flush_txfifos(USBFS_GRSTCTL_TXFNUM_HALL);
  gd32_flush_rxfifo();

  /* Clear all pending HC Interrupts */

  for (i = 0; i < GD32_NHOST_CHANNELS; i++)
    {
      gd32_putreg(GD32_USBFS_HCHINTF(i), 0xffffffff);
      gd32_putreg(GD32_USBFS_HCHINTEN(i), 0);
    }

  /* Driver Vbus +5V (the smoke test).  Should be done elsewhere in OTG
   * mode.
   */

  gd32_vbusdrive(priv, true);

  /* Enable host interrupts */

  gd32_hostinit_enable();
}

/****************************************************************************
 * Name: gd32_sw_initialize
 *
 * Description:
 *   One-time setup of the host driver state structure.
 *
 * Input Parameters:
 *   priv -- USB host driver private data structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void gd32_sw_initialize(struct gd32_usbhost_s *priv)
{
  struct usbhost_driver_s *drvr;
  struct usbhost_hubport_s *hport;
  int i;

  /* Initialize the device operations */

  drvr                 = &priv->drvr;
  drvr->ep0configure   = gd32_ep0configure;
  drvr->epalloc        = gd32_epalloc;
  drvr->epfree         = gd32_epfree;
  drvr->alloc          = gd32_alloc;
  drvr->free           = gd32_free;
  drvr->ioalloc        = gd32_ioalloc;
  drvr->iofree         = gd32_iofree;
  drvr->ctrlin         = gd32_ctrlin;
  drvr->ctrlout        = gd32_ctrlout;
  drvr->transfer       = gd32_transfer;
#ifdef CONFIG_USBHOST_ASYNCH
  drvr->asynch         = gd32_asynch;
#endif
  drvr->cancel         = gd32_cancel;
#ifdef CONFIG_USBHOST_HUB
  drvr->connect        = gd32_connect;
#endif
  drvr->disconnect     = gd32_disconnect;

