GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_usbfshost.c
  /* Initialize the public port representation */

  hport                = &priv->rhport.hport;
  hport->drvr          = drvr;
#ifdef CONFIG_USBHOST_HUB
  hport->parent        = NULL;
#endif
  hport->ep0           = (usbhost_ep_t)&priv->ep0;
  hport->speed         = USB_SPEED_FULL;

  /* Initialize function address generation logic */

  usbhost_devaddr_initialize(&priv->devgen);
  priv->rhport.pdevgen = &priv->devgen;

  /* Initialize the driver state data */

  priv->smstate   = SMSTATE_DETACHED;
  priv->connected = false;
  priv->change    = false;

  /* Put all of the channels back in their initial, allocated state */

  memset(priv->chan, 0,
         GD32_MAX_TX_FIFOS * sizeof(struct gd32_chan_s));

  /* Initialize each channel */

  for (i = 0; i < GD32_MAX_TX_FIFOS; i++)
    {
      struct gd32_chan_s *chan = &priv->chan[i];

      chan->chidx = i;
      nxsem_init(&chan->waitsem, 0, 0);
    }
}

/****************************************************************************
 * Name: gd32_hw_initialize
 *
 * Description:
 *   One-time setup of the host controller hardware for normal operations.
 *
 * Input Parameters:
 *   priv -- USB host driver private data structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

static inline int gd32_hw_initialize(struct gd32_usbhost_s *priv)
{
  uint32_t regval;
  unsigned long timeout;

  /* Configure USBFS 48MHz clock prescaler */

  regval = getreg32(GD32_RCU_CFG0);
  regval &= ~RCU_CFG0_USBFSPSC_MASK;
  regval |= GD32_USBFSPSC_VALUE;
  putreg32(regval, GD32_RCU_CFG0);

  /* Enable USBFS peripheral clock */

  regval = getreg32(GD32_RCU_AHBEN);
  regval |= RCU_AHBEN_USBFSEN;
  putreg32(regval, GD32_RCU_AHBEN);

  /* GD32E11x GUSBCS has no PHYSEL bit (bits reserved) */

  /* Perform the core soft reset. */

  gd32_putreg(GD32_USBFS_GRSTCTL, USBFS_GRSTCTL_CSRST);
  for (timeout = 0; timeout < GD32_READY_DELAY; timeout++)
    {
      regval = gd32_getreg(GD32_USBFS_GRSTCTL);
      if ((regval & USBFS_GRSTCTL_CSRST) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);

  /* Deactivate the power down */

  regval  = USBFS_GCCFG_PWRON | USBFS_GCCFG_VBUSACEN |
            USBFS_GCCFG_VBUSBCEN;
#ifndef CONFIG_USBDEV_VBUSSENSING
  regval |= USBFS_GCCFG_VBUSIG;
#endif
#ifdef CONFIG_GD32E11X_USBFS_SOFOUTPUT
  regval |= USBFS_GCCFG_SOFOEN;
#endif
  gd32_putreg(GD32_USBFS_GCCFG, regval);
  up_mdelay(20);

  /* Initialize OTG features:  In order to support OTP, the HNPCAP and SRPCAP
   * bits would need to be set in the GUSBCFG register about here.
   */

  /* Force Host Mode */

  regval  = gd32_getreg(GD32_USBFS_GUSBCS);
  regval &= ~USBFS_GUSBCS_FDM;
  regval |= USBFS_GUSBCS_FHM;
  gd32_putreg(GD32_USBFS_GUSBCS, regval);
  up_mdelay(50);

  /* Initialize host mode and return success */

  gd32_host_initialize(priv);
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: gd32_usbfshost_initialize
 *
 * Description:
 *   Initialize USB host device controller hardware.
 *
 * Input Parameters:
 *   controller -- If the device supports more than USB host controller, then
 *     this identifies which controller is being initialized.  Normally, this
 *     is just zero.
 *
 * Returned Value:
 *   And instance of the USB host interface.  The controlling task should
 *   use this interface to (1) call the wait() method to wait for a device
 *   to be connected, and (2) call the enumerate() method to bind the device
 *   to a class driver.
 *
 * Assumptions:
 * - This function should called in the initialization sequence in order
 *   to initialize the USB device functionality.
 * - Class drivers should be initialized prior to calling this function.
 *   Otherwise, there is a race condition if the device is already connected.
 *
 ****************************************************************************/

struct usbhost_connection_s *gd32_usbfshost_initialize(int controller)
{
  /* At present, there is only support for a single USBFS host. Hence it is
   * pre-allocated as g_usbhost.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct gd32_usbhost_s *priv = &g_usbhost;

  /* Sanity checks */

  DEBUGASSERT(controller == 0);

  /* Make sure that interrupts from the USBFS core are disabled */

  gd32_gint_disable();

  /* Reset the state of the host driver */

  gd32_sw_initialize(priv);

  /* Alternate function pin configuration.  Here we assume that:
   *
   * 1. GPIOA, SYSCFG, and USBFS peripheral clocking have already been\
   *    enabled as part of the boot sequence.
   * 2. Board-specific logic has already enabled other board specific GPIOs
   *    for things like soft pull-up, VBUS sensing, power controls, and over-
   *    current detection.
   */

  /* Configure USBFS alternate function pins for DM, DP, ID, and SOF.
   *
   * PIN* SIGNAL      DIRECTION
   * ---- ----------- ----------
   * PA8  USBFS_SOF  SOF clock output
   * PA9  USBFS_VBUS VBUS input for device, Driven by external regulator by
   *                  host (not an alternate function)
   * PA10 USBFS_ID   OTG ID pin (only needed in Dual mode)
   * PA11 USBFS_DM   D- I/O
   * PA12 USBFS_DP   D+ I/O
   *
   * *Pins may vary from device-to-device.
   */

  gd32_gpio_config(GPIO_USBFS_DM);
  gd32_gpio_config(GPIO_USBFS_DP);
  gd32_gpio_config(GPIO_USBFS_ID);    /* Only needed for OTG */

  /* SOF output pin configuration is configurable */

#ifdef CONFIG_GD32E11X_USBFS_SOFOUTPUT
  gd32_gpio_config(GPIO_USBFS_SOF);
#endif

  /* Initialize the USBFS core */

  gd32_hw_initialize(priv);

  /* Attach USB host controller interrupt handler */

  if (irq_attach(GD32_IRQ_USBFS, gd32_gint_isr, NULL) != 0)
    {
      usbhost_trace1(USBFS_TRACE1_IRQATTACH, 0);
      return NULL;
    }

  /* Enable USBFS global interrupts */

  gd32_gint_enable();

  /* Enable interrupts at the interrupt controller */

  up_enable_irq(GD32_IRQ_USBFS);
  return &g_usbconn;
}

#endif /* CONFIG_USBHOST && CONFIG_GD32E11X_USBFS */